kafka_benchmark_results_20251002_003914/baseline/producer-test.log
5000 records sent, 1000.0 records/sec (0.98 MB/sec), 2.8 ms avg latency, 340.0 ms max latency.
5004 records sent, 1000.8 records/sec (0.98 MB/sec), 1.2 ms avg latency, 5.0 ms max latency.
12000 records sent, 999.500250 records/sec (0.98 MB/sec), 1.87 ms avg latency, 340.00 ms max latency, 1 ms 50th, 2 ms 95th, 23 ms 99th, 32 ms 99.9th.